categories = [
        'Среднее по категориям',
        'Удобство офиса',
        'ATM',
        'Уровень сервиса',
        'Персонал',
        'Продукты и услуги',
        'Дистанционные каналы обслуживания'
    ]

colours = {
    'Сбербанк': ['rgb(23, 176, 71)', 'rgb(23, 126, 71)'],
    'Банк ВТБ': ['rgb(0, 7, 225)', 'rgb(0, 0, 139)'],
    'Альфа-Банк': ['rgb(255, 77, 0)', 'rgb(255, 30, 0)'],
    'Газпромбанк': ['rgb(45, 25, 148)', 'rgb(45, 39, 113)'],
    'Россельхозбанк': ['rgb(63, 149, 92)', 'rgb(63, 115, 72)'],
    'Почта Банк': ['rgb(200, 34, 77)', 'rgb(160, 14, 70)'],
    'Банк Открытие': ['rgb(97, 214, 213)', 'rgb(93, 178, 213)'],
    'Росбанк': ['rgb(255, 0, 0)', 'rgb(255, 23, 57)'],
    'Совкомбанк': ['rgb(111, 74, 0)'],
    'Райффайзенбанк': ['rgb(255, 255, 0)'],
    'Промсвязьбанк': ['rgb(255, 151, 0)'],
    'Банк Хоум Кредит': ['rgb(255, 59, 0)'],
    'Банк ДОМ.РФ': ['rgb(119, 255, 0)'],
    'Уралсиб': ['rgb(121, 16, 255)'],
    'ЮниКредит': ['rgb(255, 16, 124)'],
    'Сетелем Банк': ['rgb(0, 153, 32)'],
    'Русфинанс Банк': ['rgb(255, 40, 101)'],
    'Ренессанс Кредит': ['rgb(188, 0, 50)'],
    'МКБ': ['rgb(151, 0, 0)'],
    'Банк Санкт-Петербург': ['rgb(0, 0, 0)'],
    'СМП Банк': ['rgb(9, 232, 222)'],
    'Московский индустриальный банк': ['rgb(203, 118, 34)'],
    'Уральский банк реконструкции и развития': ['rgb(128, 129, 134)'],
    'Ситибанк': ['rgb(147, 112, 219)'],
    'Среднее по всем банкам': ['rgb(139, 0, 191)']
}

banks = ['Среднее по всем банкам', 'Сбербанк', 'Банк ВТБ', 'Альфа-Банк', 'Газпромбанк', 'Россельхозбанк', 'Почта Банк',
         'Банк Открытие', 'Росбанк', 'Совкомбанк', 'Райффайзенбанк', 'Промсвязьбанк', 'Банк Хоум Кредит', 'Банк ДОМ.РФ',
         'Уралсиб', 'ЮниКредит', 'Сетелем Банк', 'Русфинанс Банк', 'Ренессанс Кредит', 'МКБ', 'Банк Санкт-Петербург',
         'СМП Банк', 'Московский индустриальный банк', 'Уральский банк реконструкции и развития', 'Ситибанк']

regions = ['0 Вся Россия', '1 Республика Адыгея', '2 Республика Башкортостан', '3 Республика Бурятия', '4 Республика Алтай',
           '5 Республика Дагестан', '6 Республика Ингушетия', '7 Кабардино-Балкарская Республика',
           '8 Республика Калмыкия', '9 Карачаево-Черкесская Республика', '10 Республика Карелия', '11 Республика Коми',
           '12 Республика Марий Эл', '13 Республика Мордовия', '14 Республика Саха (Якутия)',
           '15 Республика Северная Осетия — Алания', '16 Республика Татарстан', '17 Республика Тыва',
           '18 Удмуртская Республика', '19 Республика Хакасия', '20 Чеченская Республика', '21 Чувашская Республика',
           '22 Алтайский край', '23 Краснодарский край', '24 Красноярский край', '25 Приморский край',
           '26 Ставропольский край', '27 Хабаровский край', '28 Амурская область', '29 Архангельская область',
           '30 Астраханская область', '31 Белгородская область', '32 Брянская область', '33 Владимирская область',
           '34 Волгоградская область', '35 Вологодская область', '36 Воронежская область', '37 Ивановская область',
           '38 Иркутская область', '39 Калининградская область', '40 Калужская область', '41 Камчатский край',
           '42 Кемеровская область', '43 Кировская область', '44 Костромская область', '45 Курганская область',
           '46 Курская область', '47 Ленинградская область', '48 Липецкая область', '49 Магаданская область',
           '50 Московская область', '51 Мурманская область', '52 Нижегородская область', '53 Новгородская область',
           '54 Новосибирская область', '55 Омская область', '56 Оренбургская область', '57 Орловская область',
           '58 Пензенская область', '59 Пермский край', '60 Псковская область', '61 Ростовская область',
           '62 Рязанская область', '63 Самарская область', '64 Саратовская область', '65 Сахалинская область',
           '66 Свердловская область', '67 Смоленская область', '68 Тамбовская область', '69 Тверская область',
           '70 Томская область', '71 Тульская область', '72 Тюменская область', '73 Ульяновская область',
           '74 Челябинская область', '75 Забайкальский край', '76 Ярославская область', '77 Москва',
           '78 Санкт-Петербург', '79 Еврейская автономная область', '83 Ненецкий автономный округ',
           '86 Ханты-Мансийский автономный округ - Югра', '87 Чукотский автономный округ',
           '89 Ямало-Ненецкий автономный округ', '91 Республика Крым', '92 Севастополь',
           '99 Иные территории, включая город и космодром Байконур']


links = {
    1: "https://i.ibb.co/YQd4CCt/1.png",
    2: "https://i.ibb.co/NWd46q0/2.png",
    3: "https://i.ibb.co/R9Qf6tb/3.png",
    4: "https://i.ibb.co/c3qgVV8/4.png",
    5: "https://i.ibb.co/wKpXBCx/5.jpg",
    6: "https://i.ibb.co/4Nh5PhF/6.jpg",
    7: "https://i.ibb.co/hF6pM29/7.png",
    8: "https://i.ibb.co/9TkPvbh/8.jpg",
    9: "https://i.ibb.co/yN3VmGd/9.png",
    10: "https://i.ibb.co/GHDRgkJ/10.png",
    11: "https://i.ibb.co/gypKSNP/11.png",
    12: "https://i.ibb.co/SVqBd58/12.jpg",
    13: "https://i.ibb.co/NYWwC8x/13.jpg",
    14: "https://i.ibb.co/GRBjKgS/14.png",
    15: "https://i.ibb.co/Pt7V5Yn/15.png",
    16: "https://i.ibb.co/8js0Yvp/16.png",
    17: "https://i.ibb.co/CVL7zn2/17.png",
    18: "https://i.ibb.co/QrRpw9g/18.jpg",
    19: "https://i.ibb.co/wBC1Phj/19.png",
    20: "https://i.ibb.co/yNSF7qP/20.png",
    21: "https://i.ibb.co/nrCh2qF/21.png",
    22: "https://i.ibb.co/2gdR925/22.jpg",
    23: "https://i.ibb.co/myCMdmm/23.jpg",
    24: "https://i.ibb.co/7J1n12k/24.png"
}
important_words_for_each_category = [
    #convenience +
    [['работать', 'тесно', 'уютный', 'выходной', 'удобно', 'закрытый', 'работа', 'суббота', 'час', 'электронный', \
      'рядом', 'расположить', 'место', 'расположение', 'чисто', 'помещение', 'офис', 'маленький', 'удобный', 'парковка'], \
     [0.01270279, -0.01299028, 0.01318438, 0.01334696, 0.01514373, -0.01515341, 0.01625541, 0.01987501, 0.02197243, 0.02227353,\
      0.02803489, 0.03379113, 0.03643555, 0.03742788, 0.03996098, 0.04594433, 0.04729934, 0.08337564, 0.09944838, 0.21920169]],
    #atm +
    [['поделать', 'отношение', 'банк', 'столпотворение', 'город', 'пачка', 'выдача', 'приём', 'работать', 'клиент', \
      'аппарат', 'деньга', 'вечно', 'дело', '24', 'снять', 'наличный', 'купюра', 'терминал', 'банкомат'], \
     [-1.58918837e-04, -1.67871736e-04, 1.76473864e-04, 1.77670265e-04, -1.78412796e-04, 1.98280237e-04, 2.08201818e-04, 2.15336766e-04, -2.16364777e-04, -2.57032220e-04,\
      2.63077625e-04, -5.04002900e-04, -5.08171986e-04, -5.24365972e-04, 7.91739086e-04, 1.12138810e-03, 2.29179063e-03, -2.31231741e-03, 2.44983528e-02, 9.54595815e-01]],
    #service_level +
    [['электронный', 'час', 'время', 'всегда', 'подход', 'полный', 'вопрос', 'получить', 'банкомат', 'ждать', \
      'менеджер', 'это', 'быстрый', 'медленно', 'обслуживать', 'сервис', 'долго', 'быстро', 'очередь', 'обслуживание'], \
     [0.00252652, -0.00270389, 0.00278593, 0.00316768, 0.00327973, -0.00355668, 0.0036061, 0.0036707, 0.00419491, 0.00508426,\
      0.00586235, 0.00698361, 0.00763096, -0.00800235, 0.01267801, 0.0281199, -0.03255776, 0.11608987, 0.24778885, 0.42411399]],
    #staff +
    [['приветливый', 'профессиональный', 'доброжелательный', 'банк', 'отзывчивый', 'объяснить', 'внимательный', 'помочь', 'девочка', 'сотрудница',
       'коллектив', 'девушка', 'работник', 'грамотный', 'специалист', 'консультант', 'менеджер', 'вежливый', 'сотрудник', 'персонал'], \
     [0.00298757, 0.00313243, 0.00347246, -0.00399975, 0.0045354,  0.00573186, 0.00596587, 0.00888497, 0.00913743, -0.01121417,\
      0.01381984, 0.01595395, 0.02206747, 0.02823891,0.03581297, 0.0402261,  0.04416326, 0.08870192, 0.28940987, 0.31381428]],
    #products_services +
    [['помочь', 'оформить', 'перевод', 'очередь', 'вклад', 'валюта', 'день', 'работать', 'халва', 'кредитный', \
      'продукт', 'месяц', 'выгодный', 'счёт', 'ипотека', 'условие', 'ставка', 'карта', 'процент', 'кредит'],
     [0.00615403, 0.00820439, -0.00875459, 0.00894689, 0.00971571, -0.00973828, -0.01077248, -0.01244338, 0.01276881, 0.02090655, \
      0.02162857, -0.02319366, 0.02528859, -0.0255157, 0.02849941, 0.05186563, 0.05777676, -0.0626111, -0.15101187, 0.30828416]],
    #remote_service +
    [['деньга', 'вежливый', 'почему', 'предложение', 'халва', 'счёт', 'человек', 'писать', 'карта', 'смс', \
      'невозможно', 'линия', 'мобильный', 'поддержка', 'онлайн', 'звонок', 'телефон', 'звонить', 'дозвониться', 'приложение'], \
     [-0.00428387, 0.00465897, -0.00468202, -0.0049763, 0.00500428, -0.00502992, -0.00533212, -0.00553104, -0.00680968, -0.00814913, \
      -0.00872423, -0.01221682, 0.01555021, 0.01878277, 0.02670296, -0.04237554, -0.061922, -0.11358725, -0.2024026, 0.28233888]]
]
#CONNECTION = "D:/BanksAnalysis/db/small_banks.db"
#CONNECTION = 'C:/Users/Nastasya Kirillovna/PycharmProjects/BanksAnalysis/db/banks.db'
CONNECTION = 'db/small_banks.db'